Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་ཐམས་ཅད་སྩོལ་བར་བགྱིའོ།
en: The vidyā holder should then request whatever boons he desires, and all will be granted.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་སྐྱེས་པ་དེ་ལ་སྣོད་བླངས་ཏེ། རང་གི་ལག་ནས་རིག་སྔགས་འཆང་ལ་སྩོལ་བར་བགྱིད་དོ།
en: Noble Avalokiteśvara will take the dish from the man in the middle of the fire pit and hold it out to the vidyā holder with his own hands.

source: །རིག་སྔགས་འཆང་གིས་བླངས་ནས་ཟས་ཀྱི་གོང་བུ་དེ་བཟའ་བར་བགྱིའོ།
en: The vidyā holder should take some of the food and eat it.

source: །འཚལ་བ་ཙམ་གྱི་མོད་ལ་ནམ་མཁའ་ལ་རྫུ་འཕྲུལ་གྱིས་མཆི་བར་འགྱུར་རོ། །ལུས་ལས་མེའི་སྙིང་པོ་འབར་བའི་ཁ་དོག་སྣ་ཚོགས་འབྱུང་བར་འགྱུར་རོ།
en: As soon as he does, he will magically rise into the sky, his light-filled body blazing with multicolored rays.

source: །དོན་ཡོད་པའི་རྒྱལ་པོའི་རིག་སྔགས་འཛིན་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ།། །།
en: He will become an amogha emperor of vidyādharas. “

source: འཕགས་པ་དོན་ཡོད་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་དྲུག་པ། གང་གཱའི་ཀླུང་གི་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དགུ་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་དང་མཉམ་པའི་རིག་སྔགས་འཆང་བའི་འཁོར་ལོས་སྒྱུར་བ་རྣམས་ཀྱི་རིག་སྔགས་འཆང་གིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: His retinue of vidyādhara emperors will number ninety-two hundred thousand million billion, matching the number of grains of sand in the Gaṅgā river.

source: །གང་གཱའི་ཀླུང་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དགུ་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་དང་མཉམ་པའི་གནས་ཀྱི་གཞལ་མེད་ཁང་དོན་ཡོད་རབ་ཏུ་གནས་པའི་གནས་རྣམས་འབྱུང་བར་འགྱུར་རོ།
en: The palatial amogha-founded estates that manifest will number, again, ninety-two hundred thousand million billion, matching the number of the grains of sand in the Gaṅgā river.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་རི་དང་། ཚལ་དང་ནགས་ཚལ་དང་བཅས་པ་མེ་ཏོག་དང་འབྲས་བུའི་ཤིང་རྣམ་པ་སྣ་ཚོགས་ཡལ་ག་དང་། སྦལ་མིག་དང་།
en: All the palaces will be made of the seven types of jewels and will be furnished with mountains, forests, and gardens with flowers and fruit-bearing trees.

source: ལོ་མ་དང་། རྩ་བ་དང་།
en: The trees will have a variety of unusual vines, shoots, leaves, and root growths.

source: མྱུ་གུར་བཅས་པ་ཁ་ཅིག་ནི་གསེར་གྱི་མེ་ཏོག་ཁ་ཅིག་ནི་དངུལ་གྱི་མེ་ཏོག །ཁ་ཅིག་ནི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱུང་བའི་མེ་ཏོག་དག་གོ། །གཞན་ཡང་ལྷའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་པ་དག་དང་། ཏ་མ་ལ་དང་། ཙམ་པ་ཀ་དང་།
en: Some will have golden flowers; others, silver; and still others will have flowers of different types made of seven types of jewels.

source: ལྕུག་མའི་མེ་ཏོག་དང་། ཏ་ལ་དང་། གྷན་དྷ་པར་ཤི་ཀ་དང་། སྣ་མ་དང་། ཡུ་ཏི་ཀ་དང་།
en: Some will have a variety of auspicious and unusual celestial flowers. “

source: ཏ་ར་ན་དང་། ཀུབ་བྱ་ཀའི་མེ་ཏོག་དག་དང་། ཚལ་དང་། ནགས་ཚལ་དང་། སྐྱེད་མོས་ཚལ་དགའ་བར་འགྱུར་བའི་གནས་ཀྱི་གཞལ་མེད་ཁང་གིས་མཛེས་པར་བགྱིས་པའི་གཞལ་མེད་ཁང་ཐམས་ཅད་འབྱུང་བར་འགྱུར་ཞིང་དགའ་བ་དང་ཡིད་མགུ་བ་དང་། ཡིད་དུ་མཆི་བར་འགྱུར་རོ།
en: Each palace will be adorned with pleasant, landscaped gardens and parks that provide fuel and are the homes of sal trees, tamāla trees, champak, latātāla, vārṣika, sumanas, yūthika, taraṇa, and kupyaka both charming and pleasant.

source: །ལྷའི་ཆུ་ཀླུ་དང་། འབབ་ཆུ་དང་། ལྟེང་ཀ་དང་། རྫིང་ལྷའི་ཙན་དན་གྱི་དྲིའི་ཆབ་ཀྱིས་ཡོངས་སུ་གང་བ་དེ་ལ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱུང་བའི་གཞལ་མེད་ཁང་དང་། ལྷའི་པདྨ་དང་། ཨུཏྤལ་དང་། ཀུ་མུ་ད་དང་།
en: The palaces, made from the seven types of jewels, will be graced with divine brooks, lakes, tanks, and lotus ponds, all filled with divine water scented with sandalwood and adorned with divine white, pink, and blue lotuses and water lilies.

source: པདྨ་དཀར་པོས་ལེགས་པར་བརྒྱན་པའི་ཆབ་གསེར་གྱི་བྱེ་མ་ལེགས་པར་བདལ་བའི་གཞལ་མེད་ཁང་དག་འབྱུང་བར་འགྱུར་རོ།
en: Golden sand will spread throughout the water.

source: །ལྷའི་བུ་མོ་དང་། མིའམ་ཅིའི་ཚོགས་དང་། དྲི་ཟའི་ཚོགས་ཀྱིས་དགའ་བར་བགྱིས་པ། ལྷ་དང་། ལྷ་མ་ཡིན་དང་།
en: The palaces will be made pleasant by the celestial apsarases, goddesses, kinnarīs, and gandharvīs playing there in groups.

source: དྲི་ཟ་དང་། ཀླུ་དང་། རིག་འཛིན་དང་། མིའམ་ཅིའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། ལྷའི་འབྱོར་པ་གཞལ་མེད་ཁང་ལེགས་པར་བསྟབས་པའི་གནས་ན་ཐམས་ཅད་དུ་རྩེ་བར་བགྱིད།
en: They will be filled with groups of devas, dānavas, gandharvas, nāgas, vidyādharas, and kinnaras and furnished with divine pleasure houses.

source: དགའ་བར་བགྱིད། དགའ་མགུར་སྤྱོད་པར་འགྱུར་རོ། །བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་པ་ནས་བྱང་ཆུབ་ལ་མཆིས་ཀྱི་བར་དང་།
en: The vidyā holder will play and enjoy himself there, roaming freely until his complete and final awakening.

source: ཆོས་ཀྱིས་འཁོར་ལོ་བསྐོར་བ་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་ཚེའི་ཚད་གཅིག་ཙམ་དུ་སྐྱོང་བར་བགྱིད་དོ།
en: He will sit under the Bodhi tree and subsequently turn the wheel of Dharma until he enters final nirvāṇa. All of this will occur during a single lifetime.

source: །དེ་བཞིན་དུ་གྲུབ་པ་བླ་ན་མེད་པ་ཆེན་པོ།
en: This constitutes the great, unsurpassed accomplishment.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཉིད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་ཏེ།
en: He will always have a connection with Noble Avalokiteśvara until complete and final awakening. “

source: དེ་ལྟར་ཟས་ཀྱི་གོང་བུ་སྒྲུབ་པའི་ཆོ་ག་ཤིན་ཏུ་རྙེད་པར་དཀའ་ལགས་སོ།
en: Such is the practice procedure of the sacrificial cake, which is extremely difficult to find.

source: །ཕྱོགས་བཅུ་མཐའ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་ལྷན་ཅིག་འགྲོགས་ནས་མཆི་བར་འགྱུར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་མངོན་སུམ་དུ་ཆོས་ཉན་པ་ཐོས་པར་འགྱུར་རོ།
en: The vidyā holder will travel to meet with all the tathāgatas of every buddha field in all ten directions, and he will listen to Dharma discourses in their presence.

source: །དེའི་འོད་ཟེར་འབར་བའི་སྙིང་པོས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བར་འགྱུར་རོ།
en: He will fill the great trichiliocosm with blazing light and illuminate the world systems.

source: །དོན་ཡོད་པའི་ཞགས་པ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བགྱིས་པ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་གསང་སྔགས་དང་ཕྱག་རྒྱ་རིང་བར་ཕྱེ་བའི་ཆོ་ག་ཞིབ་མོ་མཐའ་དག་རྫོགས་པར་བསྒྲུབ་པའི་ཆོ་ག་ཐམས་ཅད་དང་། ཆོ་ག་ཞིབ་མོ་རྒྱ་ཆེན་པོ་མཐའ་དག་གི་དཀྱིལ་འཁོར་འདི་ཁོ་ན་ཉིད་དུ་གནས་པར་འགྱུར་ལགས་སོ།
en: This Amoghapāśa, the heart essence of Noble Avalokiteśvara honored by all the bodhisattvas, a collection of mantras and mudrās that constitute a maṇḍala of liberation with a complete set of practice procedures, this entire huge collection of rites, will remain prominent in his memory.

source: །ཀླུའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་རྣམས་དེའི་དབང་དུ་གྱུར་ནས་རྟག་པར་རྒྱུན་དུ་མཆི་བར་འགྱུར་རོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: Tens of thousands of millions of nāga kings will remain permanently in its thrall, as will all devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ། །འོག་མིན་གྱི་གནས་ཀྱི་ལྷ་རྣམས་རིག་སྔགས་འཆང་དེའི་ཕྱི་བཞིན་རྟག་ཏུ་འབྲང་ཞིང་རྟག་པར་རྒྱུན་དུ་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: The gods up to the Akaniṣṭha realm will remain bound to the vidyā holder as his great retinue.

source: །ལྷའི་རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པའི་གཞལ་མེད་ཁང་རྣམ་པ་སྣ་ཚོགས་དག་ལྷུན་གྱིས་གྲུབ་པར་འབྱུང་བར་འགྱུར་རོ། །དེ་བཞིན་དུ་གོས་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་སྣ་ཚོགས་དང་ལྡན་པའི་གཞལ་མེད་ཁང་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: Palaces with varieties of the choicest food and drink of divine taste will spontaneously manifest for him, as will the palaces furnished with various pieces of clothing, ornaments, and adornments. “

source: དེ་ལ་སོགས་པ་སྦྱིན་སྲེག་གི་ཆོ་ག་དོན་ཡོད་པ་སྒྲུབ་པ་དག་འབྱུང་བར་འགྱུར་བའི་གྲུབ་པ་འཐོབ་པར་འགྱུར་རོ།
en: This homa rite and other amogha practices bring accomplishment that is plain to see. “

source: །འོན་ཏེ་སྐལ་བ་ཆུང་བ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ས་བོན་མ་མཆིས་པ་ཞིག་མཆིས་ལ་དེས་སྣོད་དེ་བླངས་པ་ཙམ་གྱི་མོད་ལ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐོབ་པར་འགྱུར་ཏེ། ལྷ་དང་མིའི་དཔལ་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: If a vidyā holder who lacks the seed of the buddhas and bodhisattvas due to his ill fortune grasps the dish, he will, as soon as he grasps it, acquire the might of a king and enjoy celestial and human splendor.

source: །རེག་པ་ཙམ་གྱི་མོད་ལ་ཚེ་ལྷའི་ལོ་བརྒྱ་ཁྲི་བཞི་སྟོང་ཐུབ་པར་འགྱུར་རོ། །དེ་ལ་ཕྱིས་ཀྱང་ནད་འབྱུང་བར་མི་འགྱུར་ཏེ། སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་ཀྱིས་ཉོན་མོངས་པར་མི་འགྱུར་རོ། །ཕས་ཀྱི་རྒོལ་བ་དང་། མི་མཛའ་བ་དང་།
en: By merely touching it, his lifespan will extend to eighty-four thousand god-years, he will not suffer again from any disease, and he will be free of every evil, obscuration, and affliction.

source: གདུག་པ་དང་། རབ་ཏུ་གདུག་པ་ཐམས་ཅད་ནུབ་པར་འགྱུར་རོ།
en: All his opponents and adversaries, and all wicked and corrupt beings, will disappear.

source: །སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ཡི་དགས་ཀྱི་ཡུལ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: He will likewise be saved, once and for all, from rebirth in the hell realms, the animal realm, the world of Yama, and the preta realm.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོད་གནས་གཅིག་པུར་འགྱུར་རོ།
en: He will become the sole object of worship for all beings.

source: །བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། སེམས་ཅན་ཐམས་ཅད་བལྟ་འཚལ་བར་འགྱུར་རོ། །ཐམས་ཅད་དུ་རྒྱས་པར་འགྱུར་རོ།
en: All beings—women, men, boys, and girls—will long to see him, and he will be victorious in all things.

source: །ཚིག་བཙན་ཞིང་དོན་ཡོད་པ་ཐོབ་པར་འགྱུར་རོ།
en: He will obtain amogha speech that is pleasant to hear. “

source: །འགུམ་པའི་དུས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཟིགས་པ་བཞེད་པར་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་རོ།
en: At the time of his death, all the tathāgatas will wish to see the vidyā holder, and he will behold Noble Avalokiteśvara directly.

source: །དྲན་པ་ཤིན་ཏུ་ཉེ་བར་བཞག་ནས་དུས་བགྱིད་པར་འགྱུར་རོ། །དུས་བགྱིས་ནས་སྐལ་བ་མཉམ་པར་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: At death, he will be in a state of stable awareness, and after he dies, he will, as is his destiny, be spontaneously reborn from a lotus flower in the realm of Sukhāvatī.

source: པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་ཞིང་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། །ལན་འགའ་ཡང་ཕྱིར་ངན་སོང་དུ་མཆི་བར་མི་འགྱུར་ཏེ། ཕྱིར་ཡང་མའི་མངལ་དུ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: He will remember all his previous lives and will never again fall into the lower realms or be born from a mother’s womb.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་བལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་བལྟ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་རྟག་ཏུ་མཆི་བར་འགྱུར་རོ།
en: Instead, he will move from one buddha field to another, where he will see all the tathāgatas and bodhisattvas. “

source: །དཔྲལ་བར་ཐིག་ལེ་བགྱིས་ན།
en: If the vidyā holder marks his forehead with a bindi, he will become invisible.

source: ཐམས་ཅད་དུ་མི་གདའ་བར་འགྱུར་རོ། །མེ་ལྷ་རྟག་པར་རྒྱུན་དུ་དྲན་པར་བགྱིས་པ་ཙམ་གྱིས། རང་གི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་ནས་མཆོག་ཐམས་ཅད་སྩོལ་བར་བགྱིད་དོ། །དགོས་པ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: As soon as he recalls the god of fire, the god will appear in person before him, grant him every boon, and perform all duties on his behalf. “

source: །དེ་ནས་དོན་ཡོད་བསྒོངས་པ་བསྒྲུབ་པར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་འབྲས་དང་སྲན་མ་མ་ཤར་བསྲེས་ཏེ་བསྒྲིལ་ལ་བསྒོངས་ནས། མར་དང་བུ་རམ་དང་། ཤ་ཁ་ར་དང་།
en: If the vidyā holder wants to accomplish the practice of the amogha oblation cake, he should mix rice with barley, cook it into a mush, blend it with ghee, molasses, sugar, and honey, and make it into balls the size of bilva fruits.

source: སྦྲང་རྩི་ལྷན་དུ་བརྫིས་ནས། བིལ་བའི་ཚད་ཙམ་དུ་བགྱིས་ཏེ། དེའི་འོག་ཏུ་ཤིད་ཀ་ར་བཱི་རའི་མེ་སྦར་ནས། བསྒོངས་པ་རེ་རེ་ལ་ལན་བདུན་བཟླས་བརྗོད་བགྱིས་ནས། མེའི་ནང་དུ་སྦྱིན་སྲེག་བགྱིས་ཏེ།
en: Then, after making a fire with oleander, he should offer the balls one by one into the fire, incanting each of them seven times.

source: ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་བརྒྱ་རྩ་བརྒྱད་ཙམ་སྦྱིན་སྲེག་བགྱིའོ།
en: He should offer one hundred and eight of them at each of the three junctions of the day over the period of three days.

source: །དེ་ནས་རིག་སྔགས་འཆང་ཡུངས་ཀར་དང་མེ་ཏོག་ཅི་རྙེད་པ་དང་བསྲེས་ཏེ། ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས་མེའི་དབུས་སུ་སྩལ་བར་བགྱིའོ། །འབྲས་ཡོས་དང་།
en: Then, he should combine mustard seeds with whatever flowers are available, incant them twenty-one times, and cast them into the fire.

source: ཡུངས་ཀར་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ནས་གཏོར་བར་བགྱིའོ།
en: He should also sprinkle parched rice and mustard seeds incanted seven times with the Krodharāja. “

source: །དེ་ནས་མེའི་དབུས་ནས་མེ་ལྷ་ལུས་ཕྱེད་ཙམ་ཕྱུང་ནས།
en: The god of fire will then appear in the middle of the fire, exposed from the waist up.

source: རིན་པོ་ཆེ་སྣ་བདུན་ལས་བགྱིས་པའི་སྣོད་ཟས་བསྒོངས་པས་བཀང་ནས། རིག་སྔགས་འཆང་ལ་རིག་སྔགས་འཆང་ཁྱོད་ཀྱིས་ཟས་བསྒོངས་པ་བསྒྲུབ་པའི་ཆོ་ག་གྲུབ་ཟིན་གྱིས། ལྷའི་ཟས་བསྒོངས་པ་ཆེན་པོ་ལོང་ཤིག་ཅེས་སྟོབས་པར་བགྱིད་དོ།
en: He will offer up sacrificial cakes on a dish made of seven jewels and say, ‘Vidyā holder, take these great and divine sacrificial cakes.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཟས་བསྒོངས་པའི་སྣོད་དེ་བླང་བར་བགྱིའོ།
en: You have successfully performed the practice procedure of the sacrificial cake.’

source: །བླངས་པ་ཙམ་ཁོ་ནས་བཅུད་ཀྱིས་ལེན་དུ་གྱུར་ནས།
en: The vidyā holder should accept this dish of sacrificial food; as soon as he touches it, it will transform into an elixir of longevity.

source: ནམ་མཁའ་ལ་འཕུར་བར་འགྱུར་རོ། །སྐྲ་ཅུང་ཟད་འཁྱིལ་བར་ཡང་འགྱུར་རོ། །པགས་པ་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: He will then fly up into the sky, his hair will become wavy and curly, and his complexion will become impeccably clear.

source: །རིག་སྔགས་འཆང་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་གིས་འཁོར་ལོས་སྒྱུར་བ་དྲུག་ཁྲི་བརྒྱད་སྟོང་གིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: He will become an emperor of the vidyādharas with a retinue of sixty-eight thousand.

source: །མེ་ལྷ་གནས་དང་གཞལ་མེད་ཁང་དང་བཅས། འཁོར་དང་བཅས་པ་དབང་དུ་མཆིས་ནས། ལས་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: The fire deities together with their retinues will remain in his thrall, allowing him to use their dwellings and palaces and performing all the tasks for him. “

source: །གང་དང་གང་གིས་ཟས་བསྒོངས་པ་ལ་རེག་པ་དེ་ཡང་ཐོས་པ་བསགས་པའི་རྒྱ་མཚོ་ཆེན་པོར་འགྱུར་རོ།
en: Whoever touches the sacrificial cakes will acquire great learning as vast as an ocean.

source: །དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བགྱིས་པ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་ཕྱག་རྒྱ་དང་། གསང་སྔགས་རིམ་པར་དབྱེ་བ་དང་བཅས་པ་ཆོ་ག་ཞིབ་མོ་མཐའ་དག་རྫོགས་པར་ཁ་ཏོན་དུ་གནས་པ་འདི།
en: This heart essence of Amoghapāśa, a maṇḍala of liberation honored by all the bodhisattvas, complete with its rites and the collections of mudrās and mantras, will remain prominent in his memory.

source: ཉིན་གཅིག་བཞིན་ཤློ་ཀ་སྟོང་ཀློག་གམ་འཆང་བར་བགྱིད་ན། ཚེ་བརྗེས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །པདྨ་ལས་བརྫུས་ཏེ་སྐྱེས་ནས་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ།
en: If he recites one thousand stanzas every single day and reflects on it, he will, at the end of his life, go to the realm of Sukhāvatī, where he will be spontaneously born from a lotus flower.

source: །ལན་འགའ་ཡང་ཕྱིས་དྲན་པ་བརྗེད་པར་མི་འགྱུར་རོ།
en: He will have memories of his successive births and will never again forget anything.

source: །ཚིག་བཙན་པར་འགྱུར་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྙིང་དུ་སྡུག་པར་འགྱུར་རོ།
en: His speech will be pleasant, and he will be loved by all beings.

source: །མཆོད་པ་ཆེན་པོའི་འོས་སུ་ཡང་འགྱུར་རོ།
en: He will be worthy of great honor. “

source: །དཔྲལ་བ་ལ་ཐིག་ལེ་བགྱིས་ན་མི་གདའ་བར་གྱུར་ནས། འབྱུང་པོ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས།
en: If the vidyā holder marks his forehead with a bindi, he will become invisible and will bring all bhūtas, yakṣas, and rākṣasas under his control.

source: གནས་ཀྱི་སྒོ་ཐམས་ཅད་འབྱེད་པར་འགྱུར་རོ།
en: The doors to every home will open to him.

source: །བུད་མེད་གང་ཞིག་བུའི་ཆེད་དུ་ཟས་བསྒོངས་པ་དེ་འཚལ་ན།
en: If a man’s wife desires a son and eats the sacrificial food, she will have a son.

source: བུ་གཟུགས་བཟང་བ་མཛེས་པ། བལྟ་ན་སྡུག་པ་ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་རྙེད་ནས།
en: He will be handsome, amiable, and good looking, with a most wonderful pale complexion.

source: ཡུན་རིང་དུ་འཚོ་ཞིང་ཡིད་གཞུངས་པ་དང་། མཁས་པ་དང་།
en: He will be intelligent, live long, have a keen mind, and become very learned and confident.

source: བསྟན་བཅོས་ཐམས་ཅད་ལ་བག་ཚ་བ་མ་མཆིས་པར་འགྱུར་རོ།
en: He will gain expertise in all branches of knowledge. “

source: །དེ་ནས་སྐྱེ་བོ་འབུམ་ཟས་བཙལ་བར་སེམས་ན། འོ་མའི་ཐུག་པ་བསྒྲུབ་པར་བགྱི་སྟེ། གནས་གཙང་མ་བཅོམ་སྐྱུངས་པར་ཤིང་ཀ་ར་བཱི་རའི་ལྕུག་མས་དཀྲུག་ཅིང་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་གསང་སྔགས་བཟླས་བརྗོད་བགྱིས་ཏེ།
en: If the vidyā holder wants to feed one hundred thousand people, he should procure some milk pudding and, in a clean place that is free from distractions, cook it over a fire of oleander sticks until it thickens.

source: དེ་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་ཆབ་དང་ཡུངས་ཀར་ལ་བཟླས་བརྗོད་བགྱིས་ནས་གཏོར་བར་བྱའོ།
en: He should keep the heart mantra of Amoghapāśa in mind until it is ready.

source: །དེ་ནས་ཟས་བསྒོངས་པ་གཅིག་སྣོད་ཀྱི་ནང་ནས་ཕྱུང་ནས།
en: He should then sprinkle it with water and mustard seeds incanted with the mantra of Krodharāja and place a single sacrificial cake in the pot containing the pudding.

source: འོ་ཐུག་གི་ནང་དུ་བསྩལ་ལོ། །དེ་ནས་ཆར་བགོས་ཏེ་ཐོག་མར་དཀོན་མཆོག་གསུམ་ལ་བསོད་སྙོམས་དབུལ་བར་བགྱིའོ། །དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་དབུལ་བར་བགྱིའོ། །དེའི་འོག་ཏུ་འཕགས་པ་འཇམ་དཔལ་ལ་དབུལ་བར་བགྱིའོ།
en: He should then divide it into portions and offer the first portion to the Three Jewels as alms, the next to the noble bodhisattva Avalokiteśvara, and the next to Noble Mañjuśrī.

source: །དེའི་འོག་ཏུ་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་།
en: After that, he should give them to mendicants, brahmins, kṣatriyas, vaiśyas, and śūdras.

source: བུ་མོ་རྣམས་དང་། བཀྲེན་པ་དང་། སྡུག་ཕོངས་པ་དང་། ལམ་གྱིས་དུབ་བ་དང་། སློངས་མོ་པ་རྣམས་ལ་རབ་ཏུ་སྩལ་བར་བགྱིའོ།
en: He should give them to women, men, boys, and girls, and he should give generously to the poor, the destitute, travelers, and beggars, until he has given them to one hundred thousand people.

source: །ཇི་ཙམ་དུ་སྐྱེ་བོ་འབུམ་ཅི་འཚལ་བར་ཁ་ཟས་འཚལ་དུ་སྩལ་ཀྱང་། སྣོད་དེ་གང་བའམ་བྲི་བར་མི་མངོན་ཞིང་དེ་བས་པར་མི་འགྱུར་རོ།
en: They will eat as much as they like, but the amount in the pot will neither diminish nor increase, nor will it be exhausted. “

source: །གང་དག་ཟས་དེ་འཚལ་བ་དེ་དག་སྔོན་གྱི་སྡིག་པ་དང་། སྒྲིབ་པ་དང་། རྩོད་པ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ།
en: Those who eat this food will be freed from their past obscurations, misdeeds, and impurities.

source: །ནད་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ། །དགྲ་ཐམས་ཅད་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་དང་། མི་མཛའ་བའི་འཇིགས་པ་ཐམས་ཅད་ཀྱིས་ཚུགས་པར་མི་འགྱུར་རོ། །འབྱུང་པོ་དང་།
en: They will be freed from all disease and will not face misfortunes, enemies, or adversaries.

source: གནོད་སྦྱིན་དང་། སྲིན་པོའི་འཇིགས་པ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པར་འགྱུར་རོ།
en: They will not face danger from bhūtas, yakṣas, or rākṣasas.

source: །ལུས་མཉེན་ཅིང་འཇམ་པར་འགྱུར་རོ། །ང་རོ་ལྷ་ལྟར་མཉེན་ཅིང་སྙན་ལ་དགའ་བར་བགྱིད་པ་མ་ཡིན་པའི་དབྱངས་སུ་མི་འགྱུར་རོ།
en: Their bodies will become smooth and soft, and their voices will be divinely sweet and soft like the voices of kinnaras.

source: །རྟག་ཏུ་དུབ་པའི་སྡུག་བསྔལ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པར་འགྱུར་རོ། །རྟག་ཏུ་ཇི་སྲིད་འཚོའི་བར་དུ་བདེ་བ་ཡང་དག་པར་སྟོབས་པར་འགྱུར་རོ།
en: They will always be free from evil and suffering, and they will be happy for as long as they live.

source: །ཚེ་བརྗེས་ནས་བདེ་འགྲོ་ཐམས་ཅད་དུ་འགྲོ་བར་འགྱུར་རོ།
en: After they die, they will remain on an auspicious course. “

source: །འོ་མའི་ཐུག་པས་ལྷུང་བཟེད་བཀང་ནས། དེ་གནས་མཐོན་པོ་བླ་གབ་མེད་པར་དཀྱིལ་འཁོར་བགྱིས་ཏེ། དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་བཞག་ནས། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ལྷུང་བཟེད་དེ་དབུལ་བར་བགྱིའོ།
en: The vidyā holder should fill a dish with milk pudding and, having drawn a maṇḍala at an elevated and open spot, place it in the maṇḍala circle and offer it to all the tathāgatas in the ten directions.

source: །ཕུལ་བ་ཙམ་གྱི་མོད་ལ་ཆུ་བོ་གང་གཱའི་བྱེ་མ་འབུམ་ཕྲག་བརྒྱ་སྟོང་གི་བྱེ་མ་སྙེད་ཀྱི་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྤྱན་སྔར་ལྷའི་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པའི་ལྷའི་ཟས་བསྒོངས་པ་དང་།
en: As soon as he offers it, all the tathāgatas from the ten directions, equal in number to the many hundreds of thousands of millions of billions of grains of sand in the Gaṅgā river, will arrive from each and every buddha field and stand before the vidyā holder.

source: ལྷའི་འོ་ཐུག་གིས་ལྷུང་བཟེད་བཀང་བ་དང་།
en: Dishes filled with divine foods of one hundred flavors and a bowl filled with balls of the divine milk pudding will appear.

source: ལྷའི་ཙནྡན་གྱི་དཀྱིལ་འཁོར་ལྷའི་མེ་ཏོག་སིལ་མ་བཀྲམ་པ་ཡང་འབྱུང་བར་འགྱུར་རོ།
en: A ring of divine sandalwood powder strewn with divine flowers will also appear.

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཏོགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ལྷའི་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པའི་མཆོག་གིས་བསྟབས་པར་འགྱུར་རོ།
en: All the tathāgatas who dwell in the buddha fields of the ten directions, along with their assemblies, the host of bodhisattvas, and the congregation of śrāvakas, will be sated with the excellent food of one hundred flavors. “

source: །དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་རིག་སྔགས་འཆང་ཡོན་བདག་དེའི་ཡོན་སྦྱོང་བར་མཛད་དོ། །གང་གི་ཕྱིར་ཡོན་སྤྱངས་ནས།
en: In consequence, all these tathāgatas together with their assemblies, the host of bodhisattvas, and the congregation of śrāvakas will purify the gifts of the vidyā holder and his patron.

source: སྐལ་བ་དང་མཐུན་པའི་ཚེ་འདི་ཉིད་དང་། གཞན་དུ་དབང་ཕྱུག་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ། །གྲུབ་པ་ཆེན་པོའི་གསེར་གྱིས་འབྱོར་བར་འགྱུར་རོ།
en: With his gifts purified, the vidyā holder will obtain great power, influence, and gold in the same life, as is his destiny.

source: །མཛོད་དང་བང་མཛོད་མང་པོས་རྒྱས་པར་འགྱུར་རོ།
en: His numerous granaries and treasuries will be full of riches.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་བལྟ་འཚལ་བར་འགྱུར་རོ། །ལྷ་ཐམས་ཅད་ཀྱིས་དེ་ལ་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦ་བ་བགྱིད་པར་འགྱུར་རོ།
en: All the tathāgatas will keep him in their minds, all the bodhisattvas will yearn to see him, and all deities will guard, protect, and defend him. “

source: །དེ་ནས་རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་བཅས་པ་དབང་དུ་བགྱི་བར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་ལེགས་པར་ཁྲུས་བགྱིས་ཏེ། གཙང་མས་གོས་གཙང་མ་བགོས་ནས།
en: If the vidyā holder wants to enthrall a king together with his harem and the four divisions of his army, he should make himself ritually pure, bathe, and put on clean clothes.

source: འོ་ཐུག་མར་དང་བསྲེས་པ་འདིས་ལན་བརྒྱ་རྩ་བརྒྱད་སྦྱིན་སྲེག་བགྱིའོ།
en: He should mix the milk pudding with ghee and offer it into the fire one thousand and eight times.

source: །སྒྲོན་ཤིང་དང་ཨརྐའི་ཤིང་གི་ཡམ་སྲེག་ཤིང་གིས་མེ་སྦར་བར་བགྱིའོ། །སྦྱིན་སྲེག་ལན་སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་།
en: He should then make a fire using sticks of cedar or giant milkweed and repeat the homa one thousand and eight times.

source: རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་བཅས་པ་བདག་ཉིད་དམ། ནོར་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ། །ནུབ་གསུམ་དུ་བགྱིས་ན།
en: The king, his harem, his retinue, and the four divisions of his army will remain in the vidyā holder’s thrall, putting both themselves and their wealth at his disposal. “

source: ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་གནས་དང་འཁོར་དུ་བཅས་པ་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ། །ནུབ་ལྔར་བགྱིས་ན་འབྱུང་པོ་དང་། གནོད་སྦྱིན་དང་།
en: If the vidyā holder performs this rite over three consecutive nights, all nāga kings will fall under his thrall along with their households and retinues.

source: སྲིན་པོ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: If he performs it over five consecutive nights, all bhūtas, yakṣas, rākṣasas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and other nonhuman and human beings will come under his thrall together with their retinues.

source: མི་མ་ལགས་པ་ཐམས་ཅད་དང་། མི་ཐམས་ཅད་འཁོར་དང་བཅས་པར་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ། །ནུབ་བདུན་དུ་བགྱིས་ན་རིག་སྔགས་འཛིན་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: If he performs the rite over seven consecutive nights, all vidyādharas will come under his thrall.
